Dlubal.SteelSurfaces.ISteelSurfacesCase
Interface to the Steel Surfaces Case.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetSurfaceList
Gets list of surfaces.
Returns: List of surfaces.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetSurfaceList(System.String)
Sets list of surfaces.
SurfaceList: List of surfaces.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetMaterialsCount
Gets count of materials.
Returns: Count of materials used.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetMaterialByIndex(System.Int32)
Gets material by index.
Returns: Material structure.
Index: Zero-based index of the material.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetMaterialByNumber(System.Int32)
Gets material by number.
Returns: Material structure.
No: Number of the material.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetMaterials
Gets array of materials.
Returns: Materials array.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetMaterial(System.UInt32@)
Sets material.
Material: Material structure.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetMaterials(System.UInt32@)
Sets materials by array.
Array: Array of materials to be set.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetSurfaceCount
Gets count of surfaces.
Returns: Count of surfaces.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetSurfaceByIndex(System.Int32)
Gets surface based on given index.
Returns: Structure with informations about surface.
Index: Index of the desired surface.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetSurfaceByNumber(System.Int32)
Gets surface based on given number.
Returns: Structure with informations about surface.
Number: Number of the desired surface.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetSurfaces
Gets array of surfaces.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetSurface(System.UInt32@)
Sets surface.
Surface: Surface to be set.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetSurfaces(System.UInt32@)
Sets surfaces by array.
Array: Surfaces to be set.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetDetails
Gets Steel calculation details and parameters.

Dlubal.SteelSurfaces.ISteelSurfacesCase.SetDetails(System.UInt32@)
Sets Steel calculation details and parameters.

Dlubal.SteelSurfaces.ISteelSurfacesCase.GetResults
Gets interface to results.

Dlubal.SteelSurfaces.ISteelSurfacesCase.DeleteResults
Deletes Steel Surfaces results.